/*
* Задание 8:
* Создайте структуру наследования, при которой у вас будет базовый класс и
* наследники.
* 1. Настройте отображение и реализуйте стратегию иерархии в одной таблице;
* 2. Настройте отображение и реализуйте стратегию "Table per subclass";
* 3. Настройте отображение и реализуйте стратегию "Table per class".
* Напишите логику по внесению и извлечению различных сущностей из этой
* иерархии. (стр 125)
*/

package by.domain.run;

public class Task8ORM {
    public static void main(String[] args) {

    }
}
